TexasInstruments/msp-hal_ti/mspm33/source/ti/driverlib/m33/sysctl/dl_sysctl_mspm33c321x.h
    return (DL_SYSCTL_HFXT_RANGE) (range);
}

/**
 *  @brief  Enable the HFCLK startup monitor
 *
 * The HFXT takes time to start after being enabled. A startup monitor is
 * provided to indicate to the application software if the HFXT has successfully
 * started, at which point the HFCLK can be selected to source a variety of
 * system functions. The HFCLK startup monitor also supports checking the
 * HFCLK_IN digital clock input for a clock stuck fault.
 *
 */
__STATIC_INLINE void DL_SYSCTL_enableHFCLKStartupMonitor(void)
{
    SYSCTL->SOCLOCK.HFCLKCLKCFG |= SYSCTL_HFCLKCLKCFG_HFCLKFLTCHK_ENABLE;
}

/**
 *  @brief  Disable the HFCLK startup monitor
 */
__STATIC_INLINE void DL_SYSCTL_disableHFCLKStartupMonitor(void)
{
    SYSCTL->SOCLOCK.HFCLKCLKCFG &= ~(SYSCTL_HFCLKCLKCFG_HFCLKFLTCHK_MASK);
}

/**
 *  @brief  Retrieves the calibration constant of the temperature sensor to be
 *          used in temperature calculation.
 *
 *  @retval Temperature sensor calibration data
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getTempCalibrationConstant(void)
{
    return 0;
}

/**
 *  @brief  Checks if Flash Bank swapping is enabled
 *
 *  @return Whether Flash Bank swap is enabled
 *
 *  @retval  false  This is not a multi-bank device
 */
__STATIC_INLINE bool DL_SYSCTL_isFlashBankSwapEnabled(void)
{
    return false;
}

/**
 *  @brief  Checks if executing from upper flash bank
 *
 *  @return Whether executing from upper flash bank
 *
 *  @retval  false  This is not a multi-bank device.
 */
__STATIC_INLINE bool DL_SYSCTL_isExecuteFromUpperFlashBank(void)
{
    return false;
}

 /**
 *  @brief  Checks if INITDONE has been issued by the CSC
 *
 *  @return Whether INITDONE has been issued or not
 *
 *  @retval  true  If INITDONE has been issued
 *  @retval  false If INITDONE has not been issued
 */
__STATIC_INLINE bool DL_SYSCTL_isINITDONEIssued(void)
{
    return ((SYSCTL->SECCFG.SECSTATUS & SYSCTL_SECSTATUS_INITDONE_YES) ==
            SYSCTL_SECSTATUS_INITDONE_YES);
}

/**
 *  @brief  Indicate that INIT is done
 *
 *  After INITDONE is issued, the security configuration is locked and enforced.
 *  A SYSRST will occur, restarting startup code execution, and the main
 *  application is launched.
 *
 *  There is no hardware support to enforce a timeout if INITDONE is not issued
 *  in a reasonable period of time. It is recommended that the CSC use a
 *  watchdog to ensure that INITDONE is issued in a timely manner.
 */

__STATIC_INLINE void DL_SYSCTL_issueINITDONE(void)
{
    SYSCTL->SECCFG.INITDONE |=
        (SYSCTL_INITDONE_PASS_TRUE | SYSCTL_INITDONE_KEY_VALUE);
}

/**
 *  @brief  Set the start address of the Read Execute (RX) Protect Firewall
 *
 *  Set the start of the range of Flash MAIN memory that needs to be guarded
 *  from both read and execute accesses. The firewall is configured as an
 *  address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is RX
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are RX protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] startAddr  The start address of the read execute protect
 *                        firewall. The 6 LSBs are don't cares.
 */
__STATIC_INLINE void DL_SYSCTL_setReadExecuteProtectFirewallAddrStart(
    uint32_t startAddr)
{
    SYSCTL->SECCFG.FRXPROTMAINSTART =
        (startAddr & SYSCTL_FRXPROTMAINSTART_ADDR_MASK);
}

/**
 *  @brief  Get the start address of the Read Execute (RX) Protect Firewall
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *
 *  @return  The start address of the read execute protect firewall
 */
__STATIC_INLINE uint32_t DL_SYSCTL_getReadExecuteProtectFirewallAddrStart(void)
{
    return (SYSCTL->SECCFG.FRXPROTMAINSTART);
}

/**
 *  @brief  Set the end address of the Read Execute (RX) Protect Firewall
 *
 *  Set the end of the range of Flash MAIN memory that needs to be guarded
 *  from both read and execute accesses. The firewall is configured as an
 *  address range.
 *
 *  The start and end addresses are specified at 64B sector granularity, so
 *  the 6 LSBs are don't cares.
 *  If the start address is equal to the end address, then one sector is RX
 *  protected. If the end address is equal to the start address + 1, then two
 *  sectors are protected, and so on. If the end address is less than the start
 *  address, the no sectors are RX protected. The hardware does not perform any
 *  checks on the addresses.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST.
 *
 *  @param[in] endAddr  The end address of the read execute protect firewall.
 *                      The 6 LSBs are don't cares.
 */
__STATIC_INLINE void DL_SYSCTL_setReadExecuteProtectFirewallAddrEnd(
    uint32_t endAddr)
{
    SYSCTL->SECCFG.FRXPROTMAINEND =
        (endAddr & SYSCTL_FRXPROTMAINEND_ADDR_MASK);
}

/**
 *  @brief      Enable Read Execute (RX) Protect Firewall
 *
 *  Enables the Read Execute Protect Firewall before INITDONE.
 *
 *  @note This bit can be written only before INITDONE. At INITDONE, this
 *        configuration gets locked and stays locked until the next BOOTRST
 */

__STATIC_INLINE void DL_SYSCTL_enableReadExecuteProtectFirewall(void)
{
    SYSCTL->SECCFG.FWENABLE |=
        (SYSCTL_FWENABLE_FLRXPROT_ENABLE | SYSCTL_FWENABLE_KEY_VALUE);
}


/**
 *  @brief  Enables super capacitor function
 *
 *  Allows battery backup system to be powered by a super capacitor
 */
__STATIC_INLINE void DL_SYSCTL_enableSuperCapacitor(void)
{
    SYSCTL->SOCLOCK.SYSTEMCFG |=
        SYSCTL_SYSTEMCFG_SUPERCAPEN_TRUE | SYSCTL_SYSTEMCFG_KEY_VALUE;
}

/**
 *  @brief  Disables super capacitor function
 *
 *  Prevents battery backup system from being powered by a super capacitor
 */
__STATIC_INLINE void DL_SYSCTL_disableSuperCapacitor(void)
{
    SYSCTL->SOCLOCK.SYSTEMCFG &=
        (~(SYSCTL_SYSTEMCFG_SUPERCAPEN_TRUE) | SYSCTL_SYSTEMCFG_KEY_VALUE);
}

/**
 *  @brief  Checks if super capacitor function is enabled
 *
 *  @return returns the state of the super capacitor bit
 *
 *  @retval  true  The super capacitor function is enabled
 *  @retval  false The super capacitor function is disabled
 */
__STATIC_INLINE bool DL_SYSCTL_isSuperCapacitorEnabled(void)
{
    return ((SYSCTL->SOCLOCK.SYSTEMCFG & SYSCTL_SYSTEMCFG_SUPERCAPEN_MASK) ==
            SYSCTL_SYSTEMCFG_SUPERCAPEN_TRUE);
}

/**
 *  @brief      Perform bank swap and execute from the Upper Flash Bank
 *
 *  The upper physical bank maps to logical 0x0, and gets RX permission.
 *  The lower physical bank gets RW permission.
 *
 *  @note This bit can only be written to before INITDONE. At INITDONE, this bit
 *  becomes a read-only bit until next BOOTRST.
 *
 *  @pre  DL_SYSCTL_enableFlashBankSwap
 */
__STATIC_INLINE void DL_SYSCTL_executeFromUpperFlashBank(void)
{
    SYSCTL->SECCFG.FLBANKSWP |=
        (SYSCTL_FLBANKSWP_USEUPPER_ENABLE | SYSCTL_FLBANKSWP_KEY_VALUE);
}

/**
 *  @brief      Perform bank swap and execute from the Lower Flash Bank
 *
 *  The lower physical bank maps to logical 0x0, and gets RX permission.
 *  The upper physical bank gets RW permission.
 *
 *  @note This bit can only be written to before INITDONE. At INITDONE, this bit
 *  becomes a read-only bit until next BOOTRST.
 *
 *  @pre  DL_SYSCTL_enableFlashBankSwap
 */
__STATIC_INLINE void DL_SYSCTL_executeFromLowerFlashBank(void)
{
    SYSCTL->SECCFG.FLBANKSWP &=
        (~(SYSCTL_FLBANKSWP_USEUPPER_MASK) | SYSCTL_FLBANKSWP_KEY_VALUE);
}

#ifdef __cplusplus
}
#endif

#endif /* ti_dl_m0p_dl_sysctl_sysctl__include */
/** @}*/
